{
    "locales": {
        "en": {
            "title": "Experience",
            "title_long_prefix": "Summary of my",
            "title_long": "**Work** Experience"
        },

        "es": {
            "title": "Experiencia",
            "title_long_prefix": "Resumen de mi",
            "title_long": "Experiencia **Laboral**"
        },

        "fr": {
            "title": "Expérience",
            "title_long_prefix": "Résumé de mon",
            "title_long": "Parcours **Professionel**"
        },

        "ko": {
            "title": "경험",
            "title_long_prefix": "이것은 내",
            "title_long": "**직업적** 경험"
        }
    },

    "articles": [
        {
            "id": "work",
            "component": "ArticleTimeline",
            "config": {},
            "locales": {},

            "items": [
                {
                    "icon": {
                        "img": "images/pictures/cloud.png",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },
                    "dates": {
                        "start": "10/01/2022",
                        "end": "07/01/2024"
                    },
                    "locales": {
                        "en": {
                            "title": "**Junior** Developer",
                            "info": "Cloud Exis Technolabs",
                            "text": "<p>During my 6-month internship, I developed two fully functional E-Commerce websites using PHP, gaining hands-on experience in building dynamic, user-friendly platforms from the ground up. This opportunity helped me strengthen my understanding of backend development, database integration, and project deployment.</p><p>Following the internship, I was offered a full-time position at the same company where I contributed to several Laravel-based projects and expanded my skills in modern frameworks like React.js. I also took the initiative to explore and learn WordPress, enhancing my versatility as a developer across different technologies.</p><ul> <li>React</li> <li>Laravel</li> <li>PHP</li> <li>WordPress</li> <li>SQL</li> </ul>",
                            "tags": ["PHP", "MySQL", "Laravel", "React", "Wordpress"]
                        },
                        "es": {
                            "title": "Desarrollador **Backend**",
                            "info": "Sapphire Studio",
                            "text": "Desarrollé y mantuve sistemas backend escalables para varios clientes, optimizando el rendimiento de la base de datos e implementando APIs RESTful para mejorar la funcionalidad de la aplicación.",
                            "tags": null
                        },
                        "fr": {
                            "title": "Développeur **Backend**",
                            "info": "Sapphire Studio",
                            "text": "Développé et maintenu des systèmes backend évolutifs pour divers clients, optimisant les performances de la base de données et implémentant des APIs RESTful pour améliorer la fonctionnalité de l'application.",
                            "tags": null
                        },
                        "ko": {
                            "title": "**백엔드** 개발자",
                            "info": "사파이어 스튜디오",
                            "text": "여러 클라이언트를 위해 확장 가능한 백엔드 시스템을 개발하고 유지 관리하며, 데이터베이스 성능을 최적화하고 애플리케이션 기능을 개선하기 위해 RESTful API를 구현했습니다.",
                            "tags": null
                        }
                    }
                },
                {
                    "icon": {
                        "img": "images/pictures/hetfy.png",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },
                    "dates": {
                        "start": "07/01/2024",
                        "end": "01/01/2025"
                    },
                    "locales": {
                        "en": {
                            "title": "**Web** Developer",
                            "info": "Hetfy Software Solutions",
                            "text": "Worked on enhancing the Coursera website by implementing new features and improving user experience, utilizing both frontend and backend technologies to ensure seamless functionality.",
                            "tags": ["JavaScript", "PHP", "Laravel"]
                        },
                        "es": {
                            "title": "Ingeniero **Full-Stack**",
                            "info": "Coursera",
                            "text": "Participé en la mejora del sitio web de Coursera al implementar nuevas funcionalidades y optimizar la experiencia del usuario, utilizando tecnologías de frontend y backend para asegurar un funcionamiento sin problemas.",
                            "tags": null
                        },
                        "fr": {
                            "title": "Ingénieur **Full-Stack**",
                            "info": "Coursera",
                            "text": "J'ai contribué à l'amélioration du site Web de Coursera en ajoutant de nouvelles fonctionnalités et en optimisant l'expérience utilisateur, en utilisant des technologies frontend et backend pour garantir un fonctionnement fluide.",
                            "tags": null
                        },
                        "ko": {
                            "title": "**풀스택** 엔지니어",
                            "info": "코세라",
                            "text": "Coursera 웹사이트를 개선하기 위해 새로운 기능을 추가하고 사용자 경험을 최적화했습니다. 원활한 기능을 보장하기 위해 프론트엔드와 백엔드 기술을 모두 활용했습니다.",
                            "tags": null
                        }
                    }
                },
                {
                    "icon": {
                        "img": "images/pictures/Karv.png",
                        "fa": "fa-brands fa-apple",
                        "faColors": {"bg": "#111", "fill": "#EEE"}
                    },
                    "dates": {
                        "start": "01/01/2025",
                        "end": "now"
                    },
                    "locales": {
                        "en": {
                            "title": "**Web Developer**",
                            "info": "Karv Digital Media & Event Solutions",
                            "text": "<p>Collaborating with a team of developers to build and maintain modern web applications using ReactJS and Laravel, with an emphasis on:</p> <ul><li>Creating dynamic and responsive frontends with ReactJS</li><li>Developing robust and scalable backend APIs using Laravel</li><li>Integrating MySQL for efficient and reliable data management</li><li>Implementing clean, maintainable code and best practices</li><li>Ensuring seamless communication between frontend and backend systems</li></ul> <p class='mt-3'>Our efforts focus on delivering high-performance, user-friendly solutions across various domains.</p>",
                            "tags": ["RESTful APIs", "PHP", "React" ,"Wordpress", "Laravel"]
                        },
                        "es": {
                            "title": "Desarrollador **Backend Senior**",
                            "info": "Apple Inc.",
                            "text": "<p>Liderando un equipo de desarrolladores para diseñar e implementar soluciones backend para los servicios de Apple, con enfoque en:</p> <ul><li>Seguridad</li><li>Escalabilidad para manejar millones de usuarios a nivel global</li><li>Desarrollar APIs RESTful</li><li>Optimizar el rendimiento de bases de datos con MySQL</li><li>Construcción de servicios con Swift, PHP y GraphQL</li></ul> <p class='mt-3'>Juntos, aseguramos que la infraestructura backend de Apple se mantenga robusta y eficiente.</p>",
                            "tags": ["Swift", "MySQL", "GraphQL", "RESTful APIs", "PHP"]
                        },
                        "fr": {
                            "title": "Développeur **Backend Senior**",
                            "info": "Apple Inc.",
                            "text": "<p>Dirigeant une équipe de développeurs pour concevoir et mettre en œuvre des solutions backend pour les services d'Apple, en se concentrant sur:</p> <ul><li>Sécurité</li><li>Scalabilité pour gérer des millions d'utilisateurs dans le monde</li><li>Développement d'APIs RESTful</li><li>Optimisation des performances des bases de données avec MySQL</li><li>Création de services avec Swift, PHP et GraphQL</li></ul> <p class='mt-3'>Ensemble, nous assurons que l'infrastructure backend d'Apple reste robuste et efficace.</p>",
                            "tags": ["Swift", "MySQL", "GraphQL", "RESTful APIs", "PHP"]
                        },
                        "ko": {
                            "title": "**수석 백엔드** 개발자",
                            "info": "애플 주식회사",
                            "text": "<p>Apple 서비스의 백엔드 솔루션을 설계하고 구현하는 개발 팀을 이끌며, 다음에 중점을 둡니다:</p> <ul><li>보안</li><li>수백만 명의 사용자를 처리할 수 있는 확장성</li><li>RESTful API 개발</li><li>MySQL로 데이터베이스 성능 최적화</li><li>Swift, PHP, GraphQL로 서비스 구축</li></ul> <p class='mt-3'>우리는 함께 Apple의 백엔드 인프라가 견고하고 효율적으로 유지되도록 보장합니다.</p>",
                            "tags": ["Swift", "MySQL", "GraphQL", "RESTful APIs", "PHP"]
                        }
                    }
                }
            ]
        }
    ]
}
